//-----------------------------------------------------------------
//  名称: 交流电压检测系统仿真
//-----------------------------------------------------------------
//  说明: 本例运行时,0~222V的交流电压将显示在数码管上，调整外部“被测”
//		交流电压时，数码管将实时刷新显示当前交流电压。
//
//-----------------------------------------------------------------
#include <TimerOne.h>
//0-9的数码管段码,最后1位是黑屏段码,索引为10
const uint8_t CA_SEGCODE[] =
{ 0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0xFF};
//-----------------------------------------------------------------
//75HC595引脚定义
#define SH_CP	0								//移位时钟脉冲
#define ST_CP	1								//输出锁存器控制脉冲
#define DS		2								//串行数据输入
////A/D转换器LTC1864引脚定义
#define SDO 	3								//串行数据输出引脚
#define SCK 	4								//串行时钟引脚
#define CONV 	5								//转换控制引脚
#define CONV_1()	digitalWrite(CONV,HIGH)		//CONV=1
#define CONV_0()	digitalWrite(CONV,LOW)		//CONV=0
#define SCK_1()		digitalWrite(SCK,HIGH)		//SCK=1
#define SCK_0()		digitalWrite(SCK,LOW)		//SCK=0
#define RD_SDO()	digitalRead(SDO)			//读SDO引脚
//-----------------------------------------------------------------
uint16_t Sample_Array[40];						//40次电压采样
uint8_t digit[4];
double AC_Volt,avg_AC_Volt,ui;
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//------------------------------------------------------------------
// 主循环
//------------------------------------------------------------------
void loop() {

}
//-----------------------------------------------------------------
// 595并行输出子程序
//-----------------------------------------------------------------
void Parallel_Output_595() {

}
//-----------------------------------------------------------------
// 将4位整数分解位为4个数位
// 该函数仅使用加/减运算符,这比使用/与%分解的效率要高
//-----------------------------------------------------------------
void DEC_TO_4DIGIT(int x, uint8_t d[]) {

}
//-----------------------------------------------------------------
// 交流电压检测
//-----------------------------------------------------------------
void get_AC_Voltage() {

}
//-----------------------------------------------------------------
// 读取LTC1864模数转换值(16位,2字节)
//-----------------------------------------------------------------
uint16_t Read_ADC() {

}