//-----------------------------------------------------------------
//  名称: I2C接口温度传感器DS1621应用测试
//-----------------------------------------------------------------
//  说明: 传感器可检测温度范围为-55.0℃- 125.0℃.
//		程序运行过程中,可通过动态调节温度来模拟外界温度变化,
//		本例中温度通过虚拟终端显示,当模拟外界温度超过上限时,
//		Tout将呈现高电平,继电器吸合,直到温度重新下降到TL之下时,
//		Tout才呈现低电平,断电器断开.
//
//-----------------------------------------------------------------
#include <Wire.h>
#define SUB_DEV_ADDR 0x48				//7位DS1621器件地址
uint8_t SET_CONFIG[] = { 0xAC,0x02 };	//写配置字节(命令及数据序列)
uint8_t SET_TH[] =	 { 0xA1,0,0 };		//设置TH	(命令及数据序列)
uint8_t SET_TL[] =	 { 0xA2,0,0 };		//设置TL	(命令及数据序列)
uint8_t IIC_Start_CONV[]=  { 0xEE };	//启动转换	(命令,使用数组统一编程)
uint8_t d[2] = {0x00,0x00};				//循环读取两字节温度数据
float TempX;							//浮点温度变量
char disp_buff[20];						//串口终端显示缓冲
uint8_t r = 0;							//换行控制变量	
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup (){

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}
//-----------------------------------------------------------------
// 向DS1621写入多字节
//-----------------------------------------------------------------
void Write_DS1621(uint8_t Slave_Addr,uint8_t *Buff, uint8_t n){

}
//-----------------------------------------------------------------
// 读取温度
//-----------------------------------------------------------------
void Read_DS1621_Temp(uint8_t Slave_Addr) {

}