//-----------------------------------------------------------------
// 名称：24C1024 IIC读写程序
//-----------------------------------------------------------------
#define u8	unsigned char
#define u16	unsigned int
#define u32	unsigned long
#include "STC15xxx.h"
#include <intrins.h>
sbit SCL = P2^6;		//串行时钟
sbit SDA = P2^7;		//串行数据
#include "I2C.h"		//IIC总线通用宏及函数
//-----------------------------------------------------------------
// 从24C1024读取多字节
//-----------------------------------------------------------------
u8 IIC_ReadBytes(u8 Slave,u32 Mem_address,u8 *Buf,u8 N) {


}