//-----------------------------------------------------------------
//  名称: 74HC595驱动14段数码管演示
//-----------------------------------------------------------------
//  说明: 本例运行时,8只集成式14段数码管在按键控制下依次显示几组英文与
//		数字字符串.案例中14段数码管段码表编码规则见程序内说明.
//
//-----------------------------------------------------------------
//74HC595引脚定义
#define DS		8	//串行数据输入
#define ST_CP	9	//输出锁存器控制脉冲
#define SH_CP	10	//移位时钟脉冲
#define OE		11	//使能控制
#define K1		0	//按键连接IO0引脚
#define K1_St() digitalRead(K1)			//读按键状态(按键连接IO0）
#define OE_0()  digitalWrite(OE,LOW)	//595输出使能
#define OE_1()	digitalWrite(OE,HIGH)	//595输出禁用
//本例编码按数码管各段字母顺序设计编码(先外框循环,后内部米字循环):
//A B C D E F H I J G2 K L M G1 DP(编码时注意逆向)
//14段共阳数码管段码表(本例用的是共阴数码管,输出时要取反)
const uint16_t SEG_CODE14[] =
{ 0xFB80,0xFFF9,0xDDE4,0xDDF0,0xDDD9,0xDDD2,0xDDC2,0xFFF8,0xDDC0,
	0xDDD0,0xDDC8,0xDCC2,0xFFC6,0xF770,0xDFC6,0xDFCE,0xFDC2,0xDDC9,
	0xF776,0xEF6E,0xDACF,0xFFC7,0xFE89,0xFB89,0xFFC0,0xDDCC,0xFBC0,
	0xD9CC,0xDBD6,0xF77E,0xFFC1,0xEECF,0xEBC9,0xEABF,0xF6BF,0xEEF6
};
//待显示字符串
const char str_buffer[] = "DEMO 305abcdefghijKLMNOPQRSTUVWXYZ 0123456789";
//上次按键状态
uint8_t pre_key_status = 1;
//-----------------------------------------------------------------
// 初始配置函数：setup
//-----------------------------------------------------------------
void setup() {

}
//------------------------------------------------------------------
// 获取字符的14位段码
//------------------------------------------------------------------
uint16_t get_SEG_CODE14(char c) {

}
//-----------------------------------------------------------------
// 1字节数据串行输入595子程序
//-----------------------------------------------------------------
void Serial_Input_595(uint8_t d) {

}
//-----------------------------------------------------------------
// 595并行输出子程序
//-----------------------------------------------------------------
void Parallel_Output_595() {

}
//------------------------------------------------------------------
// 主循环
//------------------------------------------------------------------
void loop() { 

}