//-----------------------------------------------------------------
//  名称: 伺服电机控制测试
//-----------------------------------------------------------------
//  说明: 本例仿真电路中共连接三个伺服电机，前两个由主循环控制以不同速度在0～180°
//        范围内来回摆动，第三个电机在定时器控制下由按键操控左右摆动.
//        
//-----------------------------------------------------------------
#include <Servo.h>						//伺服电机库：头文件
#include <MsTimer2.h>					//定时器2头文件
Servo myservo1;							//创建伺服电机对象1（最多可创建8个）
Servo myservo2;							//创建伺服电机对象2
Servo myservo3;							//创建伺服电机对象3
#define LLight		11					//左转指示灯
#define RLight		12					//右转指示灯
#define angle		3					//步进角度
int Servo3_pos;							//伺服电机3的当前角度（位置）
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() { 

}  
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() { 

}
//-----------------------------------------------------------------
// TIMER2定时中断服务函数(每15ms刷新一下）
//-----------------------------------------------------------------
void Refresh_ServoPos() {

}