//-----------------------------------------------------------------
//  名称: 带日历时钟及温度显示的电子日历牌
//-----------------------------------------------------------------
//  说明: 本例使用了DS1302读取日期时间,用MCP9700A获取温度数据
//        通过74HC595驱动数码管显示.
//
//-----------------------------------------------------------------
#include <Wire.h>				//总线库
#include "TimeLib.h"
#include "DS1302RTC.h"
DS1302RTC RTC(4,5,6);			//创建RTC对象，4,5,6->IO,SCLK,RST
tmElements_t tm;				//定义时间元素类型变量(结构类型)
//75HC595引脚定义
#define SH_CP		8			//移位时钟脉冲
#define ST_CP		9			//输出锁存器控制脉冲
#define DS			10			//串行数据输入
#define SecondBlink 11			//秒闪控制引脚
#define TEMPPin		14			//温度传感器引脚
const uint8_t CA_SEGCODE[]=	
{ 0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,//0~9的段码
  0xC6,0x9C,0xFF,0xBF			//摄氏度段码(2字节),黑屏段码,负号段码
 };						
//所有数码管的显示缓冲(年的高2位固定为20),最后2位固定为摄氏度段码索引
uint8_t disp_buff[21] = {2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11,10};
int i, j, len;							//循环索引控制变量等
int curr_second = -1;					//当前秒,用于控制秒闪的变量
char t_buff[10], c;						//显示缓冲等
long x500ms;						//秒闪控制变量(0.5s开/0.5s关)
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//------------------------------------------------------------------
// 主循环
//------------------------------------------------------------------
void loop() { 	


}
//-----------------------------------------------------------------
// 595并行输出子程序
//-----------------------------------------------------------------
void Parallel_Output_595() {

}
//-----------------------------------------------------------------
// 从MCP9700A读取模拟量转换为数字量，再转换为浮点温度
//-----------------------------------------------------------------
float Read_MCP9700A_Temp() {

}