//-----------------------------------------------------------------
// 名称: 键盘矩阵扫描程序
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#define u8  unsigned char
#define u16 unsigned int
//-----------------------------------------------------------------
// 延时
//-----------------------------------------------------------------
void Delay20us() {		//@12MHz
	u8 i = 57; _nop_();_nop_(); while (--i);
}
//-----------------------------------------------------------------
// 键盘矩阵扫描子程序
//-----------------------------------------------------------------
u8 Keys_Scan() { 
	u8 keyNo = 0xFF;
	//P2低四位输入,高四位输出,高四位置0,放入四行,扫描四列
	P2 = 0xFF; P2 = 0x0F; Delay20us();
	if (P2 == 0x0F) return 0xFF;		//无按键时提前返回
	//按键后00001111将变成0000XXXX,X中1个为0,3个仍为1
	//下面判断按键发生于0~3列中的哪一列
	switch (P2 & 0x0F) {

	
	}	
	//P2高四位输入,低四位输出,低四位置0,放入四列,扫描四行
	P2 = 0xFF; P2 = 0xF0; Delay20us();
	//按键后11110000将变成XXXX0000,X中1个为0,3个仍为1
	//下面判断按键发生于0~3行中的哪一行
	//对0~3行分别附加的起始值为: 0,4,8,12	
	switch (P2 & 0xF0) {


	}
	return keyNo;
}