//-----------------------------------------------------------------
//  名称:使用MsTimer2库实现TIMER2控制交通指示灯
//-----------------------------------------------------------------
//  说明: 东西向绿灯亮5秒后,黄灯闪烁,闪烁5次后亮红灯, 红灯亮后,南北向由红灯
//		变为绿灯,5秒后南北向黄灯闪烁, 闪烁5次后亮红灯,东西向绿灯亮,如此往复. 
//		本例将时间设得较短是为了调试的时候能较快的观察到运行效果.
//		库下载：http://playground.arduino.cc/Main/MsTimer2	
//		编译时注意将库文件夹MsTimer2复制到Arduino库文件夹libraries下.
//        
//-----------------------------------------------------------------
#include <MsTimer2.h>
#define	RED_A	 0	//东西向指示灯
#define	YELLOW_A 1
#define	GREEN_A	 2
#define	RED_B	 3	//南北向指示灯
#define	YELLOW_B 4
#define	GREEN_B  5
#define BEEP	 8	//蜂鸣器引脚
//-----------------------------------------------------------------
//延时倍数,闪烁次数,操作类型变量
uint8_t Time_Count = 0, Flash_Count = 0, Operation_Type = 1;
uint8_t YELLOW_State = HIGH;
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() { }									//空循环
//-----------------------------------------------------------------
// 交通灯控制
//-----------------------------------------------------------------
void Traffic_LED_Control() {
	switch (Operation_Type)	{
		case 1://东西向绿灯与南北向红灯亮

			break;
		case 2://东西向黄灯开始闪烁,蜂鸣器输出,绿灯关闭

			break;
		case 3://东西向红灯与南北向绿灯亮

			break;
		case 4://南北向黄灯开始闪烁,蜂鸣器输出,绿灯关闭

	}
}