//-----------------------------------------------------------------
//  名称: 数码管显示4×4键盘矩阵按键
//-----------------------------------------------------------------
//  说明: 基于矩阵键盘库Keypad完成4×4键盘矩阵按键扫描及数码管显示,
//		每次按键按下时蜂鸣器同时输出指定提示音.
//        注意将库文件夹Keypad复制到Arduino安装路径下的库文件夹libraries下.
//        同时要注意区别于另一库文件夹keyboard.
//
//-----------------------------------------------------------------
#include <Keypad.h>
//0~F的共阳数码管段码,最后1个是横线的段码
const byte CA_SEGCODE[] = {
  0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,//0~9
  0x88,0x83,0xC6,0xA1,0x86,0x8E,					//A-F
  0xBF												//横线
};
//定义4×4键盘行线与列线引脚
byte rowPins[4] = {17, 16, 15, 14}; //四条行线定义
byte colPins[4] = {11, 10,  9,  8}; //四条列线定义
//定义4×4键盘各键位对应的字符
char KeyCharsList[4][4] = {

};
//初始化Keypad类实例
Keypad kpd = Keypad(___________________);
char c; byte i;
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup(){

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}
