//---------------------------- 24C04.c ----------------------------
//  名称: AT24C04读/写驱动程序
//-----------------------------------------------------------------
#define u8 	unsigned char
#define u16	unsigned int
#include "STC15xxx.h"
#include <intrins.h>
#include <stdio.h>
#include <stdlib.h>
sbit SCL = P1^6;					//串行时钟线
sbit SDA = P1^7;					//串行数据线
#include "I2C.h"					//IIC总线通用宏及函数
//-----------------------------------------------------------------
// AT24C04所调用的外部相关函数
extern void Show_HEX(u8 dat);		//16进制格式显示字节
extern void PutStr(u8 *s);			//串口输出字符串
extern void delay_ms(u8);			//延时函数
extern u16 r;						//换行控制变量
//-----------------------------------------------------------------
// 向任意指定的地址写入一字节数据
// 器件地址码字节格式 (其中E2,E1为片选位,A8为块地址位)
// 位: B7 B6 B5 B4 B3 B2 B1 B0
// 值:  1  0  1  0 E2 E1 A8 RW
//-----------------------------------------------------------------
void Random_Write(u8 Dev_Addr,u16 mem_addr,u8 dat) {


}
//-----------------------------------------------------------------
// 从任意地址读取一字节数据
//-----------------------------------------------------------------
u8 Random_Read(u8 Dev_Addr,u16 mem_addr) {


}
//-----------------------------------------------------------------
// 从指定地址开始连续顺序读取N节数据
//-----------------------------------------------------------------
void Sequential_Read(u8 Dev_Addr,u16 mem_addr,u16 N) {


}
