//-------------------------- main.c -----------------------------------
//	名称: SPI接口温度传感器TC72应用
//---------------------------------------------------------------------
//	说明: 当程序运行时,单片机将持续从TC72温度传感器读取温度数据并转换为
//		    浮点型字符串行送入液晶屏显示(内置SPI接口须要在实物电路测试)
//
//---------------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#include <stdio.h>
#include <math.h>
#define u8	unsigned char
#define u16	unsigned int
//---------------------------------------------------------------------
//TC72寄存器地址定义
#define TC72_CTRL		0x80	//控制寄存器
#define TC72_TEMP_LSB	0x01	//温度低字节
#define TC72_TEMP_MSB	0x02	//温度高字节
#define TC72_MANU_ID	0x03	//制造商ID
//---------------------------------------------------------------------
#define SPIF 			0x80	//SPSTAT.7
#define WCOL 			0x40	//SPSTAT.6
#define SSIG 			0x80	//SPCTL.7
#define SPEN 			0x40	//SPCTL.6
#define DORD 			0x20	//SPCTL.5
#define MSTR 			0x10	//SPCTL.4
#define CPOL 			0x08	//SPCTL.3
#define CPHA 			0x04	//SPCTL.2
#define SPDHH			0x00	//CPU_CLK/4
#define SPDH 			0x01	//CPU_CLK/16
#define SPDL 			0x02	//CPU_CLK/64
#define SPDLL			0x03	//CPU_CLK/128
//---------------------------------------------------------------------
//SPI接口引脚定义(物理方式)
sbit SPI_CE		= P1^0;			//片选(TC72高电平使能，低电平禁止)
sbit SPI_SI		= P1^3;			//串行数据输入
sbit SPI_SO		= P1^4;			//串行数据输出
sbit SPI_SCK	= P1^5;			//串行时钟
//---------------------------------------------------------------------
//SPI接口引脚定义(模拟方式)
sbit CE			= P1^0;			//片选
sbit SDI		= P1^3;			//串行数据输入
sbit SDO		= P1^4;			//串行数据输出
sbit SCK		= P1^5;			//串行时钟
//---------------------------------------------------------------------
//内置SPI寄存器及寄存器位定义
//SPCON C3h SPI Control	SPR2 SPEN SSDIS MSTR CPOL CPHA SPR1 SPR0
//SPSTA C4h SPI Status	SPIF WCOL SSERR MODF - - - -
//SPDAT C5h SPI Data	SPD7 SPD6 SPD5  SPD4 SPD3 SPD2 SPD1 SPD0
sfr	SPCON	 =	0xC3;
sfr	SPSTA	 =	0xC4;
//---------------------------------------------------------------------
extern void Initialize_LCD();
extern void LCD_ShowString(u8 r, u8 c,u8 *str);
extern void delay_ms(u16 x);
//---------------------------------------------------------------------
u8 T[2];						//2个字节原始温度数据
float TempX = 0.0;				//浮点温度值
//---------------------------------------------------------------------
// SPI主机初始化 (TC72工作于SPI Mode1)
//---------------------------------------------------------------------
void SPI_init() {
	SPCTL |=  (1 << 7);			//禁用SS，配置为主机模式
	SPCTL |=  (1 << 6);			//SPI总线使能
	SPCTL &= ~(1 << 5);			//MSB高位优先
	SPCTL |=  (1 << 4);			//主机模式
	SPCTL &= ~(1 << 3);			//当时钟线信号为低电平时时钟线处于空闲状态，
								//为高电平时时钟线处于活动采样状态
	//SPCTL |=  (1 << 3);		//CPOL
	SPCTL |=  (1 << 2);			//CPHA
	//SPCTL &= ~(1 << 2);		//起始沿采样(前沿采样)
	SPCTL |= 3;					//32分频
	//I/O端口切换:
	//0: P1.2 P1.3 P1.4 P1.5
	//1: P2.4 P2.3 P2.2 P2.1
	//2: P5.4 P4.0 P4.1 P4.3
	//AUXR1 = (AUXR1 & ~(3<<2)) | (2<<2);
	SPI_SCK = 0;				//时钟线信号初始时为低电平
	SPI_SO = 1;					//SO线信号初始时为低电平
	SPI_SI = 1;					//SI线信号初始时为低电平
	SPSTAT = SPIF + WCOL;		//将SPIF和WCOL标志清零
	//使能(SPEN),主机模式(MSTR),64分频
	//	SPCTL = SPEN | MSTR; //|SPDL|CPOL;
	//	SPCTL |= CPOL | CPHA;
	//	SPSTA = SPIF | WCOL;	//置位SPIF,WCOL
}
//---------------------------------------------------------------------
// 写SPI数据(硬件SPI方式)
//---------------------------------------------------------------------
u8 SPI_Transfer(u8 dat) {

}
//---------------------------------------------------------------------
// 从当前地址读取1个字节数据(模拟SPI方式)
//---------------------------------------------------------------------
u8 ReadByte(){

}
//---------------------------------------------------------------------
// 向当前地址写入1个字节数据(模拟SPI方式)
//---------------------------------------------------------------------
void WriteByte(u8 dat) {

}
//---------------------------------------------------------------------
// 向TC72写入2个字节(地址,数据)(物理SPI方式)
//---------------------------------------------------------------------
void Write_UA_TC72(u8 addr, u8 dat) {
	SPI_CE = 1;			delay_ms(1);
	SPI_Transfer(addr);	delay_ms(1);
	SPI_Transfer(dat);	delay_ms(1);
	SPI_CE = 0;			delay_ms(1);
}
//---------------------------------------------------------------------
// 向TC72写入2个字节(地址,数据)(模拟SPI方式)
//---------------------------------------------------------------------
void Write_UB_TC72(u8 addr, u8 dat) {
	CE = 1;				delay_ms(1);
	WriteByte(addr);	delay_ms(1);
	WriteByte(dat);		delay_ms(1);
	CE = 0;				delay_ms(1);
}
//---------------------------------------------------------------------
// 写TC72配置数据(物理SPI方式)
//---------------------------------------------------------------------
void Config_UA_TC72() {
	Write_UA_TC72(TC72_CTRL,0x15);	//配置为单次转换与关断模式
}
//---------------------------------------------------------------------
// 写TC72配置数据(模拟SPI方式)
//---------------------------------------------------------------------
void Config_UB_TC72() {
	Write_UB_TC72(TC72_CTRL,0x15);	//配置为单次转换与关断模式
}
//---------------------------------------------------------------------
// 从TC72读取2个字节温度数据并转换为浮点温度值
//---------------------------------------------------------------------
void Read_UA_TC72_Temperature() {	//物理方式
	Config_UA_TC72();
	SPI_CE = 1; 
	//发送读温度高字节命令
	delay_ms(1);	SPI_Transfer(TC72_TEMP_MSB);
	//连续读取2个字节(连续读取时先得到的是高字节,后得到的是低字节)
	delay_ms(1);	T[1] = SPI_Transfer(0xFF);//读高字节
	delay_ms(1);	T[0] = SPI_Transfer(0xFF);//读低字节
	SPI_CE = 0;
	//注：当前版STC15 SPI硬件仿真有缺陷,须补充左移1位,
	//故添加了1位左移,正常情况下无此操作
	TempX = (((int)((((T[1]<<8)|T[0])<<1)>>6))) * 0.25;
	//以下是正常语句:
	//TempX = (((int)(((T[1]<<8)|T[0]))>>6)) * 0.25;
}
//---------------------------------------------------------------------
void Read_UB_TC72_Temperature() {	//模拟方式

}
//---------------------------------------------------------------------
// 主程序
//---------------------------------------------------------------------
void main() {
	char DisplayBuffer[17];
	P0M1 = 0x00; P0M0 = 0x00;			//配置为准双向口
	P1M1 = 0x00; P1M0 = 0x00;			//仅P1.4为高阻输入，其他为准双向口
	P2M1 = 0x00; P2M0 = 0x00;
	P3M1 = 0xFF; P3M0 = 0x00;			//将P2配置为高阻输入
	CLK_DIV |= 0x07;					//主时钟128分频
	CLK_DIV |= (1<<3)|(1<<6)|(1<<7);
	Initialize_LCD();
	LCD_ShowString(0,0," SPI TC72 TEST ");
	SPI_init();		//SPI主机初始化(专门针对内置SPI接口)
	while(1) {

	}
}