//-----------------------------------------------------------------
// 名称: 自定义通用函数
//-----------------------------------------------------------------
#include "FAT/mytype.h"
#include "myfun.h"
#include "string.h"
void delay(u16 time) {
	while (time--) ;
}
//-----------------------------------------------------------------
// 长整数转换为字符串
//-----------------------------------------------------------------
void ULong_Str(u32 dat, char* str) {
	char idata temp[20];
	u8 idata i = 0,j = 0;
	i = 0;
	while (dat)	{
		temp[i] = dat % 10 + 0x30;
		i++; 		dat /= 10;
	}
	j = i;
	for (i = 0; i < j; i++)	{
		str[i] = temp[j - i - 1];
	}
	if (!i) { str[i++] = '0'; }
	str[i] = 0;
}

