//---------------------------- PCF8583.c --------------------------
// 名称: PCF8583实时时钟驱动程序
//-----------------------------------------------------------------
#define u8 	unsigned char
#define u16	unsigned int
#include "STC15xxx.h" 
#include <intrins.h>
#include <string.h>
sbit SCL = P2^0;
sbit SDA = P2^1;
#include "I2C.h"					//IIC总线通用宏及函数
#include "PCF8583.h"				//日期时钟芯片驱动程序头文件
//0,1,2,3,4,5,6分别对应周日,周一至六
char WEEK[][4] = {"SUN","MON","TUS","WEN","THU","FRI","SAT"};
//所读取的PCF8583数据及转换后的日期时间数据
u8 PCF8583_DATA[5],DateTime[7];
//-----------------------------------------------------------------
// 从PCF8583指定地址读多字节到buf缓冲
//-----------------------------------------------------------------
void Read_PCF8583(u8 addr,u8 *buf,u8 n) {


}
//-----------------------------------------------------------------
// 读取7字节PCF8583时钟数据并整理到DateTime数组
//-----------------------------------------------------------------
void GetDateTime() {


}