//-----------------------------------------------------------------
//  名称: 电子秤仿真设计
//-----------------------------------------------------------------
//  说明: 本例运行时,LCD显示当前压力(未转换为重量),所输入的价格将
//		  直接与该值相乘,LCD显示计算后的应付金额.
//
//-----------------------------------------------------------------
#include <LiquidCrystal.h>
LiquidCrystal lcd(8, 9, 10, 4, 5, 6, 7);	//初始化LCD
//按键判断及按键键值
#define Key_Pressed (digitalRead(0) == 1)	//DA高电平时有键按下
#define Key_NO		(PINC & 0x0F)			//解码器连接在PINC低四位
//键盘字符表(其中注意2,5,8后各保留一个空格)
const char KEY_CHAR_TABLE[] = "012 345 678 9.C";
//模数转换结果,上次转换结果,压力换算结果
volatile int AD_Val, Pre_Result = 0, Pressure_Value = 0;
//LCD显示输出缓冲(价格/重量/金额)的最大长度
//因为要预留结束标志,实际串长比定义少1位
#define PLEN	7
#define WLEN	4
#define SUMLEN  10
//LCD显示输出缓冲(价格/重量/金额)
char disp_buffer_P[PLEN];
char disp_buffer_W[WLEN];
char disp_buffer_SUM[SUMLEN];
//价格输入缓冲索引
uint8_t NumberPtr = 0;
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}
//-----------------------------------------------------------------
// 计算并显示金额
//-----------------------------------------------------------------
void Compute_and_show_sum() {

}
//-----------------------------------------------------------------
// 处理键盘操作
//-----------------------------------------------------------------
void KeyBoard_Handle() {

}