//-----------------------------------------------------------------
//  名称: DS1302 实时时钟显示程序
//-----------------------------------------------------------------
//  说明: 从DS1302中读取时钟数据,在LCD上显示日期和时间.
//
//-----------------------------------------------------------------
#include <LiquidCrystal.h>
#include "DS1302RTC.h"
#include "TimeLib.h"
#include <string.h>
//创建液晶对象，8~10对应：RS,RW引脚,E,4~7对应D4~D7引脚
LiquidCrystal lcd(8, 9, 10, 4, 5, 6, 7);
//创建RTC对象，14,15,16分别对应：IO,SCLK,RST引脚
DS1302RTC RTC(14,15,16); 
//0~6分别对应周日,周一至周六
char *WEEK[] = {"SUN","MON","TUS","WEN","THU","FRI","SAT"};
//LCD显示缓冲
char LCD_DSY_BUFFER1[] = {"DATE 00-00-00   "};
char LCD_DSY_BUFFER2[] = {"TIME 00:00:00   "};
tmElements_t tm;	//定义日期时间结构类型变量tm，类型定义于timelib.h
//-----------------------------------------------------------------
// 初始配置函数：setup
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 日期与时间值转换为数字字符（使用sprintf时该函数可省略）
//-----------------------------------------------------------------
void Format_DateTime(int d, char *a) {

}
//-----------------------------------------------------------------
// 主循环函数：loop
//-----------------------------------------------------------------
void loop() { 

 }