//-----------------------------------------------------------------
//  名称: DS18B20驱动程序
//  (源代码中所标延时值均为12MHz晶振下的延时)
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#include <stdio.h>
#define u8		unsigned char
#define u16		unsigned int
sbit DQ = P3^3;									//DS18B20 DQ引脚定义
u8 Temp_Value[] = {0x00,0x00};	//从DS18B20读取的温度值
//-----------------------------------------------------------------
// 延时函数@12MHz
//-----------------------------------------------------------------
void delay_us(u16 x) { while (x--) {_nop_();_nop_();_nop_();_nop_();}}
//-----------------------------------------------------------------
// 初始化DS18B20(注意在选定的振荡器频率12M下设置符合时序规定的延时)
//-----------------------------------------------------------------
u8 Init_DS18B20() {

}
//-----------------------------------------------------------------
// 读一字节 
//-----------------------------------------------------------------
u8 ReadOneByte() {

}
//-----------------------------------------------------------------
// 写一字节 
//-----------------------------------------------------------------
void WriteOneByte(u8 dat) {

}
//-----------------------------------------------------------------
// 读取温度值 
//-----------------------------------------------------------------
u8 Read_Temperature() {
	if( Init_DS18B20() == 1 ) return 0;		//DS18B20故障
	else {
		WriteOneByte(0xCC);									//跳过序列号
		WriteOneByte(0x44);									//启动温度转换
		Init_DS18B20();											//再次初始化
		WriteOneByte(0xCC);									//跳过序列号
		WriteOneByte(0xBE);									//读温度寄存器
		Temp_Value[0] = ReadOneByte();			//读取温度低8位
		Temp_Value[1] = ReadOneByte();			//读取温度高8位
		return 1;
	}
}