//-----------------------------------------------------------------
//  名称: 温室综合监控系统仿真设计
//-----------------------------------------------------------------
//  说明: K1~K3按键分别控制通风、采光及水泵电机开关,LCD显示温湿度及气压值.
//        上位机按钮可分别实现K1~K3的控制功能,系统运行时,下位机温湿度及
//        气压值将刷新显示在上位机C#窗体中.
//
//-----------------------------------------------------------------
#include <LiquidCrystal.h>				//液晶库
//创建液晶对象，8~10对应：RS,RW引脚,E,4~7对应D4~D7引脚
LiquidCrystal lcd(8, 9, 10, 4, 5, 6, 7);
#include <Wire.h>						//总线库
#define MAX_CHAR 11						//允许接收并保存的最大字符个数
uint8_t recv_buff[MAX_CHAR+1];			//串口接收缓冲
uint8_t Buf_Index = 0;					//缓冲索引
uint8_t recv_OK = 0;					//上位机命令串接收成功标识
char Disp_Buffer[21];					//LCD显示缓冲
char s[7];								//临时缓冲
float f;								//温湿度变量
//-----------------------------------------------------------------
//相关按键、控制引脚等定义
//-----------------------------------------------------------------
#define KINT		2					//三个按键触发中断输入引脚（与门实现）
#define K1			16					//通风电机控制按键
#define K2			17					//采光电机控制按键
#define K3			18					//水泵电机控制按键
//-----------------------------------------------------------------
#define PUMP		11					//水泵控制继电器
#define F_A			12					//通风电机控制端
#define F_B			13					//采光电机控制端
uint8_t PUMPSta = 1,F_ASta = 1, F_BSta = 1;
//-----------------------------------------------------------------
#define TEMPPin		14					//温度传感器引脚
#define HUMIPPin	15					//湿度传感器引脚
#define PRESSURE	16					//压力传感器引脚
//-----------------------------------------------------------------
#define K1_DOWN()	(digitalRead(K1) == 0)	//通风电机按键按下
#define K2_DOWN()	(digitalRead(K2) == 0)	//采光电机按键按下
#define K3_DOWN()	(digitalRead(K3) == 0)	//水泵开关按键按下
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {
	
}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {	


}
//-----------------------------------------------------------------
// LCD字符串显示（在指定行列显示字符串）
//-----------------------------------------------------------------
void LCD_ShowString(uint8_t r, uint8_t c,char *s) {

}
//-----------------------------------------------------------------
// 从MCP9700A读取模拟量转换为数字量，再转换为浮点温度
//-----------------------------------------------------------------
float Read_MCP9700A_Temp() {

}
//-----------------------------------------------------------------
// 从HIH-5030读取模拟量转换为数字量，再转换为双精度湿度
//-----------------------------------------------------------------
double Read_HIH5030_HUMI(){

}
//-----------------------------------------------------------------
// 从MPX4250读取压力并转换为浮点值
//-----------------------------------------------------------------
float Read_MPX4250_Pressure(){

}
//-----------------------------------------------------------------
// INT0中断函数(响应K1~K3)
//-----------------------------------------------------------------
void INT0_K1_K3() {

}
//-----------------------------------------------------------------
// 串口接收函数
//-----------------------------------------------------------------
void XSerialEvent() {

}