//-------------------------- DS1302.h -----------------------------
//  名称:DS1302时钟芯片驱动程序头文件
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#define u8	unsigned char
#define u16	unsigned int
sbit IO 	= P2^0;					//DS1302数据线
sbit SCLK	= P2^1;					//DS1302时钟线
sbit RST 	= P2^2;					//DS1302复位线
//-----------------------------------------------------------------
// 相关函数声明
//-----------------------------------------------------------------
u8 DateTime[7];	 					//所读取的日期时间
void Write_A_Byte_TO_DS1302(u8 x);	//向DS1302写入一字节
u8 Get_A_Byte_FROM_DS1302(); 		//从DS1302读取一字节
u8 Read_Data(u8 addr);				//从DS1302指定位置读取数据
void GetDateTime() ;				//读取当前日期时间 