//-----------------------------------------------------------------
//  名称: PG160128A(T6963C)液晶图文演示
//-----------------------------------------------------------------
//  说明: 本例综合演示了PG160128A(T6963C)液晶的中英文显示、位图显示、
//        正弦曲线显示、统计图显示（模拟）.
//        注意1：如果要在源程序中直接使用中文字符串，则必须将源程序文件由
//        “Chinese Simplified-GB2312”编码格式转换为“Unicode(UTF-8)”
//        编码格式，然后再重新编译. 如果源程序中直接提供了中文字符串的
//        “Unicode或UTF-8”编码，则可以直接编译。
//        注意2：编译本例时还要将U8g2库文件夹复制到Arduino库文件夹libraries下.
//
//-----------------------------------------------------------------
#include <Arduino.h>
#include <U8g2lib.h>
#include "MyU8g2fonts_HT.c"				//自定义字模数据（黑体）
#include "MyU8g2fonts_unifont.c"			//自定义字模数据（普通宋体）
#include "picture.h"						//待显示的位图数据
//按键定义
#define S1	0	//中英文显示（自定义字体）
#define S2	1	//位图显示
#define S3	2	//正弦曲线显示
#define S4	3	//统计图显示（模拟）
#define S1_ON()  (digitalRead(S1) == 0)
#define S2_ON()  (digitalRead(S2) == 0)
#define S3_ON()  (digitalRead(S3) == 0)
#define S4_ON()  (digitalRead(S4) == 0)
//-----------------------------------------------------------------
// T6963C实例化，RD-5V, FS0、FS1-GND,8~11,4~7接D0~D7,17-WR,14-CE,15-CD,16-RST
U8G2_T6963_240X128_1_8080 u8g2(U8G2_R0, 8, 9, 10, 11, 4, 5, 6, 7, 17,14,15,16);
uint8_t Statistics_Data[] = {20,70,80,40,90,65,30};//待显示的统计数据
float x0 = 0, y0 = 0, px0 = 0, py0 = 0;			  //坐标变量
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}
//-----------------------------------------------------------------
// 绘制条形图
//-----------------------------------------------------------------
void Draw_BarGraph(uint8_t d[]) {

}