//---------------------------------------------------------------------
//  名称: TIMER4定时器控制交通指示灯
//---------------------------------------------------------------------
//  说明: 东西向绿灯亮5s后,黄灯闪烁,闪烁5次后亮红灯
//		 红灯亮后,南北向由红灯变为绿灯,5s后南北向黄灯闪烁
//		 闪烁5次后亮红灯,东西向绿灯亮,如此往复
//		 本案例将时间设得较短是为了在调试的时候能较快观察到运行效果
//				
//---------------------------------------------------------------------
#include "STC15xxx.h"
#define u8 	unsigned char
#define u16	unsigned int
sbit	RED_A		=	P1^0;	//东西向指示灯
sbit	YELLOW_A	=	P1^1;
sbit	GREEN_A		=	P1^2; 
sbit	 RED_B		=	P1^3;	//南北向指示灯
sbit	YELLOW_B	=	P1^4;
sbit	GREEN_B		=	P1^5;
//延时倍数,闪烁次数,操作类型变量定义
volatile u16 Time_Count = 0, Flash_Count = 0, Operation_Type = 1;
//---------------------------------------------------------------------
#define FOSC 11059200L			//系统时钟频率
#define	T4MS (u16)(65536-5000*(FOSC/1000000.0))	//5ms/1T@11.0592M
//---------------------------------------------------------------------
// T4初始化配置（1T/模式0/5ms@11.0592MHz）
//---------------------------------------------------------------------
void Timer4Init() {


}
//-----------------------------------------------------------------
// T4中断子程序(中断号为20)
//-----------------------------------------------------------------
void Timer4_Routine() interrupt 20 {
	switch (Operation_Type) {
		case 1: //东西向绿灯与南北向红灯亮5秒

		
		case 2: //东西向黄灯开始闪烁(5ms×80=400ms),绿灯关闭

		
		case 3: //东西向红灯与南北向绿灯亮5秒

		
		case 4: //南北向黄灯开始闪烁(5ms×80=400ms)

		
	}
}
//---------------------------------------------------------------------
// 主程序
//---------------------------------------------------------------------
void main() {
	P1M1 = 0; P1M0 = 0;		//P1端口配置为准双向口
	Timer4Init();			//T4初始化
	IE2 |= 0x40;			//使能T4中断（置ET4=1）
	EA = 1;					//开总中断
	while(1);
}