//-----------------------------------------------------------------
//	名称：SRF04雷达测距传感器应用
//-----------------------------------------------------------------
//	说明：模拟调节当前距离时，检测到的距离值将显示在工作于4位模式下
//        LCD1602液晶屏上.
//
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include "LCD1602-4bit.h"
#include <intrins.h>
#include <stdio.h>
#define u8  unsigned char
#define u16 unsigned int
#define u32 unsigned long
sbit ECHO = P0^6;		//回声引脚
sbit TRIG = P0^7;		//触发引脚(开始一次测距)
u8 flag;				//定时计数溢出标识（超出测距范围）
float dist;				//测距值
char disp_buff[20];		//显示缓冲
void initialize_LCD();	//液晶初始化
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
void Delay20us(){ //@12.000MHz

}
//-----------------------------------------------------------------
// T0/T1初始化
//-----------------------------------------------------------------
void Timer_0_1_Init() {

}
//-----------------------------------------------------------------
// T1中断程序（注：12M/12,1us时钟驱动从0累加,至0xFFFF再增加时溢出触发中断,
// 每趟最大计时值为65535us)
//-----------------------------------------------------------------
void timer1() interrupt 3 {

}
//-----------------------------------------------------------------
// 测距函数(测距值保存于变量dist)
//-----------------------------------------------------------------
void get_Distance() { 

}
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main() {
	P0M1 = 1<<6; P0M0 = 0x00;	//P0.6设为高阻输入，其他为准双向口
	P1M1 = 0x00; P1M0 = 0x00;	//P1设为准双向口
	initialize_LCD();			//液晶初始化
	LCD_ShowString(0,0,"---SRF04 TEST---");
	Timer_0_1_Init();			//T0/T1定时器初始化
	EA = 1; 					//开启总中断
	ET1 = 1; 					//定时器1开启中断
	while (1) {

	}
}