//-------------------------- main.c -------------------------------
//  名称: 1602字符液晶工作于8位模式直接驱动显示
//-----------------------------------------------------------------
//  说明: 本例液晶实现了四项演示功能,分别为水平滚动,带光标显示随机
//        算术式,全码表字符显示,CGRAM自定义字符显示.
//	  
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#define u8  unsigned char
#define u16 unsigned int
sbit SW1 = P3^0;	//水平水平滚动显示
sbit SW2 = P3^1;	//带光标显示随机算术式
sbit SW3 = P3^2;	//全码表字符显示
sbit SW4 = P3^3;	//CGRAM自定义字符显示
u8 code msg[] =		//待滚动显示的字符串(字符串最前面加了16个空格)
"                you are going to spend even more time working on the schematic ?";
//-----------------------------------------------------------------
extern delay_ms(u16 x);
extern void Initialize_LCD();
extern void Write_LCD_Data(u8 dat);
extern void Write_LCD_Command(u8 cmd);
extern void Busy_Wait();
extern void LCD_ShowString(u8,u8,u8 *);
//-----------------------------------------------------------------
//自定义CGRAM字符及图标点阵数据(共两组,每组字符不超过8个)
u8 code CGRAM_Dat1[][8] = {	//7个矩形字符，高度由1~7横递增
	{0x00,0x00,0x00,0x00,0x00,0x00,0x1F,0x00},	//1横
	{0x00,0x00,0x00,0x00,0x00,0x1F,0x1F,0x00},	//2横
	{0x00,0x00,0x00,0x00,0x1F,0x1F,0x1F,0x00},	//3横
	{0x00,0x00,0x00,0x1F,0x1F,0x1F,0x1F,0x00},	//4横
	{0x00,0x00,0x1F,0x1F,0x1F,0x1F,0x1F,0x00},	//5横
	{0x00,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x00},	//6横
	{0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x1F,0x00} 	//7横
};
u8 code CGRAM_Dat2[][8] = {	//5个汉字字符
	{0x08,0x0F,0x12,0x0F,0x0A,0x1F,0x02,0x00},	//年
	{0x0F,0x09,0x0F,0x09,0x0F,0x09,0x13,0x00},	//月
	{0x0F,0x09,0x09,0x0F,0x09,0x09,0x0F,0x00},	//日
	{0x1F,0x0A,0x1F,0x0A,0x0A,0x0A,0x12,0x00},	//开
	{0x0A,0x1F,0x04,0x1F,0x04,0x0A,0x11,0x00} 	//关
};
//-----------------------------------------------------------------
// 将自定义字符点阵写入CGRAM
//-----------------------------------------------------------------
void Write_CGRAM(u8 g[][8], u8 n) {


}
//-----------------------------------------------------------------
// SW1: 水平滚动显示字符串
//-----------------------------------------------------------------
void H_Scroll_Display() {


}
//-----------------------------------------------------------------
// SW2: 带光标显示随机算术式
//-----------------------------------------------------------------
void Cursor_Display() {


}
//-----------------------------------------------------------------
// SW3: 全码表字符显示
//-----------------------------------------------------------------
void Show_All_Inter_Chars() {


}
//-----------------------------------------------------------------
// SW4: CGRAM自定义字符显示
//-----------------------------------------------------------------
void Display_CGRAM_Chars() {


}
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main() {
	P0M1 = 0x00;	P0M0 = 0x00;			//设置为准双向口
	P1M1 = 0x00;	P1M0 = 0x00;
	P2M1 = 0x00;	P2M0 = 0x00;
	P3M1 = 0xFF;	P3M0 = 0x00;			//P3设置为高阻输入
	Initialize_LCD();						//初始化LCD
	TR0  = 1;								//启动定时器,提供随机种子
	while(1)	{							//主循环控制实现各类演示

	
	}
}