//-----------------------------------------------------------------
//  名称: L298N驱动双极步进电机运行
//-----------------------------------------------------------------
//	说明: 本例由L298驱动双极四相步进电机(PM35L-048),按下K1时电机正转3圈,
//		按下K2时反转3圈,按下K3时正反各1.5圈.
//		在进行相应操作时,对应指示灯将被点亮，且会观察到电机的转速变化效果.
//
//-----------------------------------------------------------------
#include <Stepper.h>					//步进电机库头文件
#define STEPS 48						//每圈48步(48*7.5°=360°)
//定义步进电机对象myStepper，Arduino 8~11号引脚驱动
//对应电机A黑 B棕 C桔 D黄
Stepper myStepper(STEPS, 8, 9, 10, 11);
#define K1_DOWN() ((PINC & (1<<0)) == 0)	//K1按键判断
#define K2_DOWN() ((PINC & (1<<1)) == 0)	//K2按键判断
#define K3_DOWN() ((PINC & (1<<2)) == 0)	//K3按键判断
#define LED1	0		//LED1引脚定义
#define LED2	1		//LED2引脚定义
#define LED3	2		//LED3引脚定义
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {	

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {
 
}