//-----------------------------------------------------------------
//  名称：Arduino内置EEPROM读写测试
//-----------------------------------------------------------------
//  说明: 按下K1向EEPROM 0x0000地址开始写入512个有序字节,
//        按下K2时向0x0200地址开始写入100个A/D转换数据（字）,
//        按下K3时读取EEPROM中的前512个有序字节并送串口输出显示,
//        按下K4时读取EEPROM中的后100个A/D数据（字）并送串口输出显示,
//        注意将本例EEPROM库文件夹复制安装到Arduin文件夹libraries下.
//
//-----------------------------------------------------------------
#include <EEPROM.h>
char s[6];							//字符串转换缓冲
int i;								//循环变量
uint16_t addr = 0;					//EEPROM地址变量
uint8_t OP = 0;						//操作代码变量
#define LED	6						//LED指示灯
#define K1	8						//4个按键引脚定义
#define K2	9
#define K3	10
#define K4	11
//各类Arduino的EEPROM空间：
//- Arduno Duemilanove: 	512b
//- Arduino Uno:        	1kb
//- Arduino Mega:       	4kb
//- Teensy 3.0 & 3.1:   	2kb
//- Teensy-LC:          	128b
//- Teensy 2.0:         	1kb
//- Teensy++ 2.0:       	4kb
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup(){ 

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}