//------------------------ AT25F4096.c ----------------------------
//  名称: SPI接口存储器AT25F4096读写与显示
//-----------------------------------------------------------------
#define u8  unsigned char
#define u16 unsigned int
#define u32 unsigned long
#include "STC15xxx.h"
#include <intrins.h>
#include <intrins.h>
#include <stdlib.h>
//SPI接口存储器引脚定义
sbit SCK = P0^3;				//串行时钟控制脚
sbit SI  = P0^4;				//串行数据输入
sbit SO  = P0^5;				//串行数据输出
sbit CS  = P0^6;				//片选
//SPI接口存储器操作命令定义
#define WREN			0x06	//使能写
#define WRDI			0x04	//禁止写
#define RDSR			0x05	//读状态
#define WRSR			0x01	//写状态
#define READ			0x03	//读字节
#define WRITE			0x02	//写字节
#define SECTOR_ERASE	0x52	//删除区域数据
#define CHIP_ERASE		0x62	//删除芯片数据
#define RDID			0x15	//读厂商与产品ID
//-----------------------------------------------------------------
// 延时函数
//-----------------------------------------------------------------
#define MAIN_Fosc 12000000L
void delay_ms(u8 ms){
	u16 i;
	do{
		i = MAIN_Fosc / 13000;
		while(--i);
	}while(--ms);
}
//-----------------------------------------------------------------
// 从当前地址读取一字节数据
//-----------------------------------------------------------------
u8 ReadByte() {

}
//-----------------------------------------------------------------
// 向当前地址写入一字节数据
//-----------------------------------------------------------------
void WriteByte(u8 dat) {

}
//-----------------------------------------------------------------
// 读AT25F4096A芯片状态
//-----------------------------------------------------------------
u8 Read_SPI_Status() {

}
//-----------------------------------------------------------------
// AT25F4096A忙等待
//-----------------------------------------------------------------
//void Busy_Wait(){ while(Read_SPI_Status() & 0x01);}	//忙等待
//-----------------------------------------------------------------
// 向AT25F4096A写入三个字节的地址0x000000-0x01FFFF 
//-----------------------------------------------------------------
void Write_3_Bytes_SPI_Address(u32 addr) {



}
//-----------------------------------------------------------------
// 从指定地址读单字节
//-----------------------------------------------------------------
//u8 Read_Byte_From_AT25F4096A(u32 addr) {
//	u8  dat;
//	CS = 0;									//片选
//	WriteByte(READ);						//发送读指令
//	Write_3_Bytes_SPI_Address(addr); 		//发送三字节地址
//	dat = ReadByte();						//读取一字节数据
//	CS = 1;									//禁止片选
//	return dat;								//返回读取的字节
//}
//-----------------------------------------------------------------
// 从指定地址读多字节到缓冲
//-----------------------------------------------------------------
void Read_Bytes_From_AT25F4096A(u32 addr, u8 *p, u16 len) {



}