//-----------------------------------------------------------------
//	名称: ULN2803驱动单极步进电机正反转
//-----------------------------------------------------------------
//	说明: 本例电机为28BYJ-48，运行时按下K1电机正转3圈,按下K2反转3圈,
//		  按下K3时正反各1.5圈.在进行相应操作时,对应的指示灯被点亮.
//				
//-----------------------------------------------------------------
#include <Stepper.h>					//步进电机库头文件
#define STEPS 64						//每圈64步(64*5.625°=360°)
//定义步进电机对象myStepper，Arduino 8~11号引脚驱动
//对应电机D蓝、B黄、C粉、A橙
Stepper myStepper(STEPS, 8, 9, 10, 11);
#define K1_DOWN() ((PINC & (1<<0)) == 0)	//K1按键判断
#define K2_DOWN() ((PINC & (1<<1)) == 0)	//K2按键判断
#define K3_DOWN() ((PINC & (1<<2)) == 0)	//K3按键判断
#define LED1	0		//LED1引脚定义
#define LED2	1		//LED2引脚定义
#define LED3	2		//LED3引脚定义
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {	

}
//-----------------------------------------------------------------
// 主循环
// 注：以下所说的圈数是步进电机内部转子的圈数，非外部驱动轴的圈数，因为步进
// 电机28BYJ-48减速比为1:64,因此外部驱动轴速度是内部转子速度的1/64,如果
// 要外部驱动轴转N圈，则myStepper.step(STEPS*N)
// 应改为：myStepper.step(STEPS*N*64);
//-----------------------------------------------------------------
void loop() {

}