//-----------------------------------------------------------------
//	名称: GPS导航系统仿真
//-----------------------------------------------------------------
//	说明：本例运行时,由GPS实物模块或虚拟GPS软件Virtual GPS输出的
//        GPS协议数据将被系统接收,并对其中的"$GPRMC"协议数据进行解析,
//        所获取的当前经度、纬度、速度、时间信息将被刷新显示在LCD上.
//		
//-----------------------------------------------------------------
#include <LiquidCrystal.h>
LiquidCrystal lcd(8, 9, 10, 4, 5, 6, 7);	//4位模式
//-----------------------------------------------------------------
uint8_t rec_OK = 0;						//接收OK标识
char time[]		= "00:00:00 ";			//时间格式字符串
char Longitude[]	= "ddd\xDF mm.mmmm' X";	//经度格式字符串:\xDF->度
char Latitude[]	= " dd\xDF mm.mmmm' X";	//纬度格式字符串
char velocity[12];						//地面速度字符串
const char p[]	= "$GPRMC";				//协议头部字符串
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {	

}
//-----------------------------------------------------------------
// 串口接收处理函数,对所接收的GPS各协议数据中"$GPRMC"进行解析,例如:
// $GPRMC,194633.656,A,8702.999833,N,12149.593667,E,130.07,6,180308,...
//-----------------------------------------------------------------
void XserialEvent() {	//附注：以下数据还可以使用TinyGPS库进行解析


}