//-----------------------------------------------------------------
//  名称: I2C存储器设计的中文硬件字库应用
//-----------------------------------------------------------------
//  说明: 本例将262K的16*16点阵中文字库文件HZK16拆分为两个128K文件,
//		分别保存到两片24C1024中,多余6K字节被删除,运行本例时,对于
//		任意输入的汉字或中文标题符号,程序会直接从24C1024所保存的
//		字库中提取点阵并转换为位图格式,显示在中文液晶屏上.
//		本例程序基于U8g2库驱动LGM12864(KS1008)液晶演示(使用u8g2.drawBMP)
//		编译本例时直接将U8g2库文件夹复制到Arduino的库文件夹libraries下.
//
//-----------------------------------------------------------------
#include <Arduino.h>
#include <Wire.h>
#include <U8g2lib.h>
//创建u8g2对象,全缓冲模式,8~11, 4~7对应液晶显的D0~D7引脚
//-----------------------------------------------------------------
U8G2_KS0108_128X64_F u8g2(U8G2_R0, 8, 9, 10, 11, 4, 5, 6, 7,
/*enable=*/ 12, /*dc=*/ 17, /*cs0=*/ 14, /*cs1=*/ 15,
/*cs2=*/ U8X8_PIN_NONE, /* reset=*/ U8X8_PIN_NONE);
//-----------------------------------------------------------------
//汉字点阵数据存放区（从汉字字库提取）
uint8_t Word_Dot_Matrix[32];
//-----------------------------------------------------------------
//待显示的中文内容：
//"饮茶粤海未能忘，","索句渝州叶正黄。","三十一年还旧国，","落花时节读华章。",
//"牢骚太盛防肠断，","风物长宜放眼量。","莫道昆明池水浅，","观鱼胜过富春江。"
//-----------------------------------------------------------------
//以下头文件以ANSI编码格式保存，直接提供了上述中文内容的字符数组定义
#include "Poemx.h"		//引入该头文件时，可以屏蔽下面的直接编码定义
/*-----------------------------------------------------------------
const uint8_t Poem[8][16] = {	//以下直接提供了汉字内码
{0xD2,0xFB,0xB2,0xE8,0xD4,0xC1,0xBA,0xA3,0xCE,0xB4,0xC4,0xDC,0xCD,0xFC,0xA3,0xAC},
{0xCB,0xF7,0xBE,0xE4,0xD3,0xE5,0xD6,0xDD,0xD2,0xB6,0xD5,0xFD,0xBB,0xC6,0xA1,0xA3},
{0xC8,0xFD,0xCA,0xAE,0xD2,0xBB,0xC4,0xEA,0xBB,0xB9,0xBE,0xC9,0xB9,0xFA,0xA3,0xAC},
{0xC2,0xE4,0xBB,0xA8,0xCA,0xB1,0xBD,0xDA,0xB6,0xC1,0xBB,0xAA,0xD5,0xC2,0xA1,0xA3},
{0xC0,0xCE,0xC9,0xA7,0xCC,0xAB,0xCA,0xA2,0xB7,0xC0,0xB3,0xA6,0xB6,0xCF,0xA3,0xAC},
{0xB7,0xE7,0xCE,0xEF,0xB3,0xA4,0xD2,0xCB,0xB7,0xC5,0xD1,0xDB,0xC1,0xBF,0xA1,0xA3},
{0xC4,0xAA,0xB5,0xC0,0xC0,0xA5,0xC3,0xF7,0xB3,0xD8,0xCB,0xAE,0xC7,0xB3,0xA3,0xAC},
{0xB9,0xDB,0xD3,0xE3,0xCA,0xA4,0xB9,0xFD,0xB8,0xBB,0xB4,0xBA,0xBD,0xAD,0xA1,0xA3}};
*/
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup(){

}
//-----------------------------------------------------------------
// 从I2C EEPROM读取n字节数据到缓冲Word_Dot_Matrix
//-----------------------------------------------------------------
uint8_t AT24C1024_read(uint8_t chip_No, uint32_t dataAddress, uint8_t n) {

}
//-----------------------------------------------------------------
// 读取汉字点阵并将字库点阵格式转换为本例液晶显示所需的简易位图格式
//-----------------------------------------------------------------
void Read_dotMatrix_AND_Convert(uint8_t C1, uint8_t C2) {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}