//-----------------------------------------------------------------
//  名称: 74HC595驱动16段数码管演示
//-----------------------------------------------------------------
//  说明: 本例运行时,8只集成式16段数码管在按键控制下依次显示几组英文
//		与数字字符串.案例中16段数码管段码表编码规则见程序内说明.
//  
//-----------------------------------------------------------------
//74HC595引脚定义
#define DS		8	//串行数据输入
#define ST_CP	9	//输出锁存器控制脉冲
#define SH_CP	10	//移位时钟脉冲
#define OE		11	//使能控制
#define K1		0	//按键连接IO0引脚
#define K1_St() digitalRead(K1)			//读按键状态(按键连接IO0）
#define OE_0()  digitalWrite(OE,LOW)	//595输出使能
#define OE_1()	digitalWrite(OE,HIGH)	//595输出禁用
//本例编码按数码管各段字母顺序设计编码(先外框循环,后内部米字循环):
//A1 A2 B C D2 D1 E F H I J G2 K L M G1 DP(编码时注意逆向)
//16段共阳数码管段码表(本例用的是共阴数码管,输出时要取反)
const uint16_t SEG_CODE16[] = 
{ 0xEE00,0xFFF3,0x7788,0x77C0,0x7773,0x7744,0x7704,0xFFF0,0x7700,
  0x7740,0x7730,0x7304,0xFF0C,0xDDC0,0x770C,0x773C,0xF704,0x7733,
  0xDDCC,0xDD9C,0x6B3F,0xFF0F,0xFA33,0xEE33,0xFF00,0x7738,0xEF00,
  0x6738,0x6F4C,0xDDFC,0xFF03,0xBB3F,0xAF33,0xAAFF,0xDAFF,0xBBCC
};
//待显示字符串
const char str_buffer[] = "DEMO 305abcdefghijKLMNOPQRSTUVWXYZ 0123456789";
//上次按键状态
uint8_t pre_key_status = 1;
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {
 
}
//------------------------------------------------------------------
// 获取字符的16位段码
//------------------------------------------------------------------
uint16_t get_SEG_CODE16(char c) {
 
}
//-----------------------------------------------------------------
// 1字节数据串行输入595子程序
//-----------------------------------------------------------------
void Serial_Input_595(uint8_t d) {
 
}
//-----------------------------------------------------------------
// 595并行输出子程序
//-----------------------------------------------------------------
void Parallel_Output_595() {
 
}
//------------------------------------------------------------------
// 主循环
//------------------------------------------------------------------
void loop() { 
 
}