/*****************************************************************************************************
Title: 				main header file
Current 			version: v1.0
Function:			Define variables,Statement subfunction.
processor: 	                STM32F10
Clock:				8-72M  Hz
Author:		
Company:			
Contact:			
E-MAIL:				
Data:				  
*******************************************************************************************************/ 

#ifndef  __USART_H__
#define  __USART_H__
/******************************************************************************************************
========================================include head==================================================
******************************************************************************************************/
#include "stm32f10x.h"
#include <stdio.h>
/******************************************************************************************************
========================================Define I/O==================================================
******************************************************************************************************/

/******************************************************************************************************
========================================Define Data==================================================
******************************************************************************************************/

#define EN_USART1_RX 			1		//使能（1）/禁止（0）串口1接收

/******************************************************************************************************
========================================变量定义==================================================
******************************************************************************************************/

typedef struct //UartData_
{
	unsigned char Buff[5][50];			//接收缓冲区
	unsigned char Ind[5];							//接收索引
	unsigned char Outd;							    //发送索引
	unsigned char Time[5];							//接收超时
	unsigned char Status[5];							//接收完成	
  unsigned char Com[5];	               //命令
	
}UartData;

/******************************************************************************************************
========================================子函数声明==================================================
******************************************************************************************************/



//void USART_Config(void) ;
//void USART_Configuration(void);
void Uart1_Send_Byte(u8 Byte); //串口1发送
void Uart2_Send_Byte(u8 Byte); //串口2发送
void Uart3_Send_Byte(u8 Byte); //串口3发送
void Uart4_Send_Byte(u8 Byte); //串口4发送
void Uart5_Send_Byte(u8 Byte); //串口5发送

void Uart1_Send(uint8_t *Data, uint8_t Len);     //串口1发送
void Uart2_Send(uint8_t *Data, uint8_t Len);     //串口2发送
void Uart3_Send(uint8_t *Data, uint8_t Len);     //串口3发送
void Uart4_Send(uint8_t *Data, uint8_t Len);     //串口4发送
void Uart5_Send(uint8_t *Data, uint8_t Len);     //串口5发送

void UART1_String_Send(char *SendData);//字符串发送函数
void UART2_String_Send(char *SendData);//字符串发送函数
void UART3_String_Send(char *SendData);//字符串发送函数
void UART4_String_Send(char *SendData);//字符串发送函数
void UART5_String_Send(char *SendData);//字符串发送函数
void Printf(char *SendData);//字符串发送函数	


void UART1_Init(u32 bound);
void UART2_Init(u32 bound);
void UART3_Init(u32 bound);
void UART4_Init(u32 bound);
void UART5_Init(u32 bound);


int fputc(int ch, FILE *f);
int GetKey (void);

/******************************************************************************************************
========================================Head END==================================================
******************************************************************************************************/

#endif


