//-----------------------------------------------------------------
//	名称：温湿度传感器DHT22应用
//-----------------------------------------------------------------
//	说明：调用DHT22传感器库函数读取温湿度数据，经转换后在4位模式的
//        液晶屏上显示.
//
//-----------------------------------------------------------------
#include <LiquidCrystal.h>
LiquidCrystal lcd(8, 9, 10, 4, 5, 6, 7);	//创建液晶对象（四位模式）
#include "DHT.h"						//引用DHT库
#define DHTPIN 2					//DHT22数据线引脚
#define DHTTYPE DHT22				//DHT类型：DHT 22(AM2302)
//创建DHT对象，16MHz Arduino UNO下第3个参数默认为6（区分0、1时间间隔）.
DHT dht(DHTPIN, DHTTYPE, 6);
char temp[6];						//温度浮点数转换缓冲
char humi[5];						//湿度浮点数转换缓冲
char disp_buff[17];					//LCD显示缓冲
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}