//----------------------- I2C_MCP3421.c ---------------------------
//  名称: IIC接口A/D转换器MCP3421读写程序
//-----------------------------------------------------------------
#define u8  unsigned char
#define u16 unsigned int
#include "STC15xxx.h"
#include <intrins.h>
sbit SCL = P2^6;						//MCP3421串行时钟线
sbit SDA = P2^7;						//MCP3421串行数据线
#include "I2C.h"						//IIC总线通用宏及函数
#define MCP3421_DEV_ADDR_W 	0xD0		//MCP3421器件地址定义(写)
#define MCP3421_DEV_ADDR_R 	0xD1		//MCP3421器件地址定义(读)
//-----------------------------------------------------------------
// 向MCP3421写配置字节
//-----------------------------------------------------------------
void Write_MCP3421(u8 d) {

}
//-----------------------------------------------------------------
// 从MCP3421读取A/D转换结果,前3字节为转换数据,最后1字节为配置或状态字节
//-----------------------------------------------------------------
void Read_MCP3421(u8 *d) {

}