//--------------------------- main.c ------------------------------
//  名称: 1-Wire总线可寻址开关DS2405应用测试
//-----------------------------------------------------------------
//  说明: 本例使用了1-Wire式可寻址开关器件DS2405,连接单片机的三个
//		按键可通过单片机分别控制三个继电器的开关.
//
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#include <stdio.h>
#define u8  unsigned char
#define u16 unsigned int
#include "DS2405.h"
//3只DS2405的ROMCODE(提前读取)
const u8 DS2405_ROMCODE[][8] = {
  {0x05,0xC5,0xC3,0x08,0x00,0x00,0x00,0xCD},
  {0x05,0xB3,0xBF,0x08,0x00,0x00,0x00,0xAB},
  {0x05,0xB4,0xBF,0x08,0x00,0x00,0x00,0x2E}
};
//按键定义
#define K1_DOWN() ((P2 & (1<<0)) == 0x00)
#define K2_DOWN() ((P2 & (1<<1)) == 0x00)
#define K3_DOWN() ((P2 & (1<<2)) == 0x00)
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main() {
	P0M1 = 0x00; P0M0 = 0x00;		//P0配置为准双向口
	P2M1 = 0xFF; P2M0 = 0x00;		//P2配置为高阻输入
	while(1) {

	
	}
}