//-----------------------------------------------------------------
//  名称: SD卡FAT文件系统读写测试
//-----------------------------------------------------------------
//  说明: 本例运行时,按下K1~K4可分别向SD卡文件系统中写入不同数据，
//		  创建文件夹、显示文件内容、删除文件等.
//
//-----------------------------------------------------------------
#include <SPI.h>
#include <SD.h>
const int chipSelect = 4;					//SD卡使能控制线
File myFile;								//创建文件对象
//本例进行测试的几个文件，注意文件名格式DOS格式：8.3
const char *myFileName1 =	"myTest.txt";
const char *myFileName2 =	"mydatlog.txt";
const char *dfile1 =		"/a/b/c/test1.txt";
const char *dfile2 =		"/a/b/test2.txt";
const char *dfile3 =		"/a/b/test3.txt";
#define K1	17				//四个按键定义
#define K2	16
#define K3	15
#define K4	14
#define K1_DOWN() (digitalRead(K1) == 0)	//K1按下判断
#define K2_DOWN() (digitalRead(K2) == 0)	//K2按下判断
#define K3_DOWN() (digitalRead(K3) == 0)	//K3按下判断
#define K4_DOWN() (digitalRead(K4) == 0)	//K4按下判断
//------------------------------------------------------------------
// 初始配置函数
//------------------------------------------------------------------
void setup() {

}
//------------------------------------------------------------------
// 主循环函数
//------------------------------------------------------------------
void loop() {

}
//------------------------------------------------------------------
// 显示指定文件内容
//------------------------------------------------------------------
void Show_FileContent(char *filename) {

}
//------------------------------------------------------------------
// 删除指定文件
//------------------------------------------------------------------
void Remove_File(char *filename) {

}