//-----------------------------------------------------------------
//  名称: 继电器及双向可控硅控制照明设备
//-----------------------------------------------------------------
//  说明: K1/K2分别控制继电器与可控硅开关.
//
//-----------------------------------------------------------------
#define K1    2		//继电器控制按键
#define K2    3		//双向可控硅控制按键
#define RELAY 4		//继电器控制引脚
#define TRIAC 5		//双向可控硅控制引脚
#define K1_DOWN() (digitalRead(K1) == HIGH) //判断K1是否按下
#define K2_DOWN() (digitalRead(K2) == HIGH) //判断K2是否按下
byte RELAY_x = HIGH; //定义状态初值:0x01
byte TRIAC_x = HIGH; 
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {
	if (K1_DOWN()){			//继电器开关控制

	}
	if (K2_DOWN()) {		//可控硅开关控制

	}
}