//------------------------- keypad.c ------------------------------
// 名称: 键盘扫描程序
//-----------------------------------------------------------------
#define u8  unsigned char
#define u16 unsigned int
#include "STC15xxx.h"
#include <intrins.h>
char code keycodes[] = {				//矩阵键盘键值表
'7','8','9','/',
	'4','5','6','*',
	'1','2','3','-',
	'C','0','=','+'
};
//上述数组也可以定义为:
//char code keycodes = "789/456*123-C0=+";
char xdata keyflags[4][4];			//16键键位状态标识数组(1:按下 0:未按下)
//-----------------------------------------------------------------
// 获取键盘按键字符子程序
//-----------------------------------------------------------------
char GetKeyChar() {

}