//-----------------------------------------------------------------
//  名称: 1-Wire总线温度传感器DS18B20应用测试
//-----------------------------------------------------------------
//  说明: 运行本例时,外界共享1-wire总线的四只传感器温度将刷新显示在液晶屏上.
//		 编译本例时需要OneWire库支持，其下载地址如下：
//       https://www.pjrc.com/teensy/td_libs_OneWire.html
//		 http://playground.arduino.cc/Learning/OneWire
//		 https://github.com/PaulStoffregen/OneWire
//	     OneWire库可直接复制到Arduino的库文件夹Libraries下
//
//-----------------------------------------------------------------
#include <LiquidCrystal.h>
LiquidCrystal lcd(8, 9, 10, 4, 5, 6, 7);
#include <OneWire.h>		//1-Wire总线库
OneWire ds(12);				//创建DS18B20对象，DQ连接12脚
float temp[4];				//四只温度传感器的温度值
uint8_t tcount = 0;			//计数变量
int idx = 0;				//索引变量
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {


}