//-----------------------------------------------------------------
//	名称: Nokia5110(PCD8544)液晶显示测试
//-----------------------------------------------------------------
//	说明: 本例在Nokia5110液晶演示了3项菜单功能,分别是LED闪烁控制,
//		  继电器开关控制、蜂鸣器输出.
//
//-----------------------------------------------------------------
#include <Arduino.h>
#include <U8g2lib.h>
#include <SPI.h>
//创建实例，页缓冲模式1，SPI接口 (PCD8544中Nokia5110显示器驱动芯片)
U8G2_PCD8544_84X48_1_4W_SW_SPI u8g2(U8G2_R0,
/*时钟线=*/ 13, /*数据线=*/ 11, /*片选线=*/ 10, /*数据/命令线=*/ 9,
/*复位线=*/ 8);
#define LED		12		//LED控制引脚
#define RELAY	18		//继电器控制引脚
#define BEEP	19		//蜂鸣器控制引脚
const char *menu_list =	//菜单项（各行之间无括号、无分号及逗号）,末行除外
 "1.Flash LEDs   \n"
 "2.Relay Control\n"
 "3.Sounder      ";		//最后一项菜单后不要加“\n”，其后加分号表示结束
uint8_t sele_idx = 1;	//菜单选项（默认为第1项）
uint8_t RELAY_status = 0, LED_status = 0;
//-----------------------------------------------------------------
// 初始配置
//-----------------------------------------------------------------
void setup() {

}
//-----------------------------------------------------------------
// 主循环
//-----------------------------------------------------------------
void loop() {

}