//-----------------------------------------------------------------
//  名称: 1602字符液晶(HD44780)工作于4位模式显示DS1302时钟
//-----------------------------------------------------------------
//  说明: 从DS1302中读取时钟数据,在LCD上显示日期时间(1602工作于4位模式).
//
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#define u8	unsigned char
#define u16	unsigned int
//0~6分别对应周日,周一至周六
u8 *WEEK[] = {"SUN","MON","TUS","WEN","THU","FRI","SAT"};
//LCD显示缓冲(注意串长均为16,两个字符串中DATE和TIME后各有一个空格
//字符串的最后面各有3个空格.
char LCD_BUF_1[] = "DATE 00-00-00   ";
char LCD_BUF_2[] = "TIME 00:00:00   ";
extern void GetDateTime() ;							//读取当前日期时间
extern void Initialize_LCD();						//LCD初始化
extern void LCD_ShowString(u8, u8,u8 *);//在LCD上显示字符串
extern u8 DateTime[7];									//所读取的日期时间
extern void delay_ms(u8);
//-----------------------------------------------------------------
// 日期与时间值转换为数字字符
// 输入的参数d为BCD码时，使用语句[1]、[2]之一
// 输入的参数d为10进制数时，使用语句[3]
// 建议DS1302.c内的函数GetDateTime直接返回BCD码,这样可节省一次转换.
// 如果在GetDateTime内转换为10进制数返回,本函数内再转换为字符,
// 这将影响运行速度.
//-----------------------------------------------------------------
void Format_DateTime(u8 d, u8 *a) { 
	//如果GetDateTime函数直接返回BCD码返回则使用下面的语句
	*a = (d >> 4) + '0'; *(a+1) = (d & 0x0F) + '0';	//[1]
	//或者使用下面的语句,更优的写法显然是上面含有位运算符(>>,&)的语句
	//*a = d / 16 + '0';  *(a+1) = d % 16 + '0';	//[2]
	//--------------------------------------------------
	//如果GetDateTime函数将BCD码转换为10进制数以后再返回
	//则应使用下面的语句
	//*a = d / 10 + '0'; *(a+1) = d % 10 + '0';		//[3]
} 
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main() {
	P0M1 = 0x00; P1M0 = 0x00;		//P0、P2配置为准双向口
	P2M1 = 0x00; P2M0 = 0x00;
	Initialize_LCD();						//液晶初始化
	while(1) {

	
	}
}