//--------------------------- 24C04.c -----------------------------
// 名称: 24C04 IIC读写程序 
//-----------------------------------------------------------------
#define u8	unsigned char
#define u16	unsigned int
#include "STC15xxx.h"
#include <intrins.h>
sbit SCL = P3^0;					//串行时钟
sbit SDA = P3^1;					//串行数据
#include "I2C.h"					//IIC总线通用宏及函数
//-----------------------------------------------------------------
// 向指定的地址写数据
// 器件选择码字节格式 (其中E2,E1为片选位,A8为块地址位)
// 位: B7 B6 B5 B4 B3 B2 B1 B0
// 值:  1  0  1  0 E2 E1 A8 RW
//-----------------------------------------------------------------
void Write_IIC(u8 Dev_Addr,u16 mem_addr,u8 dat) {

}
//-----------------------------------------------------------------
// 从任意地址读取数据(器件选择码字节参上一函数说明)
//-----------------------------------------------------------------
u8 Random_Read(u8 Dev_Addr,u16 mem_addr) {

}
