//------------------------ PCF8591.c ------------------------------
//  名称: I2C接口PCF8591驱动程序
//-----------------------------------------------------------------
#include "STC15xxx.h"
#include <intrins.h>
#define u8	unsigned char
#define u16	unsigned int
#define u32	unsigned long
sbit SCL	= P2^6; 						//I2C时钟引脚
sbit SDA	= P2^7; 						//I2C数据输入输出引脚
#include "I2C.h"							//I2C总线通用宏及函数
//-----------------------------------------------------------------
// 连续读入4路通道的A/D转换结果并保存到缓冲R
//-----------------------------------------------------------------
void ADC_PCF8591(u8 CtrlByte, u8 *R) { 


}
//-----------------------------------------------------------------
// 向PCF8591发送1字节,进行D/A转换
//-----------------------------------------------------------------
void DAC_PCF8591(u8 CtrlByte,u8 dat) {


}