//-----------------------------------------------------------------
//	名称: 16位模数转换芯片LTC1864应用
//-----------------------------------------------------------------
//	说明: 外部输入模拟电压经LTC1864模/数转换后显示在LCD屏上.
//
//-----------------------------------------------------------------
#define u8  unsigned char
#define u16 unsigned int
#define u32 unsigned long
#include "STC15xxx.h"
#include <intrins.h>
#include <stdio.h>
#include <math.h>
sbit SDO =	P2^0;	//串行数据输出引脚
sbit SCK =	P2^2;	//串行时钟引脚
sbit CONV =	P2^4;	//转换控制引脚
extern void Initialize_LCD();
extern void LCD_ShowString(u8 r, u8 c,u8 *str);
extern void Delay1ms();
//-----------------------------------------------------------------
// 读取LTC1864模数转换值(16位,2字节)
//-----------------------------------------------------------------
long Read_ADC() {

}
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
void main() {
	char dispBuff[17];
	P0M1 = 0; P0M1 = 0;						//配置为准双向口
	P2M1 = 0; P2M1 = 0;
	Initialize_LCD();			//初始化LCD
	LCD_ShowString(0,0,"LTC1864 A/D Test");
	while(1) {

	}
}